{
  "hardSkills": [
    "Around 5 years in Web Development.",
    "Specialized in creating dynamic, responsive UIs using HTML, (S)CSS, Tailwind, JavaScript, TypeScript, React, and Next.js.",
    "Experienced with developing server applications and APIs (Node.js and Express), including robust authentication and authorization, and decent proficiency in database management (MongoDB, MySQL).",
    "Knowledge of CMS platforms (Drupal, WordPress).",
    "Proficient in performance optimization and SEO (Webpack, Lighthouse, PageSpeed Insights).",
    "Committed to accessible, WCAG-compliant web solutions.",
    "Advanced in frontend methodologies (BEM, SMACSS, Atomic Design), state management (Redux, Tanstack Query).",
    "Collaborative UI/UX design (Adobe XD, Figma, Photoshop).",
    "Proficient in quality assurance (Jest, React Testing Library).",
    "Effective in agile project management and leadership."
  ],
  "softSkills": [
    "Proficient in English, ensuring effective communication and complex concept articulation.",
    "Consistently reliable, dedicated, self-motivated.",
    "Inquisitive, always seeking knowledge and staying abreast of industry trends.",
    "Methodical, organized, detail-oriented in coding and documentation.",
    "Open-minded, promoting inclusivity, kindness, and respect.",
    "Empathetic and adaptable, enhancing teamwork and client relations."
  ],
  "jobs": [
    {
      "title": "Frontend Developer",
      "company": "Agiledrop",
      "companyLink": "https://www.agiledrop.com/",
      "type": "Full-time",
      "period": "Aug 2021 - Feb 2024 (2 yrs 7 mos)",
      "location": "Maribor, Slovenia (Remote)",
      "tasks": [
        "Contributed significantly to the development and maintenance of responsive and dynamic websites and web applications, with a strong focus on leveraging React and Next.js for optimal performance and user experience.",
        "Engaged in building feature-rich, scalable front-end architectures and implementing modern React best practices, including efficient state management and server-side rendering with Next.js.",
        "Collaborated effectively with a multidisciplinary team of developers, project managers, designers, and clients, ensuring successful project execution and delivery."
      ],
      "skills": [
        "React",
        "Next.js",
        "JavaScript",
        "TypeScript",
        "CSS",
        "Sass",
        "Drupal",
        "Docker",
        "Webpack",
        "GraphQL"
      ]
    },
    {
      "title": "Web Developer",
      "company": "Interstellar Support",
      "companyLink": "https://interstellarsupport.com/",
      "type": "Contract",
      "period": "Apr 2021 - Aug 2021 (5 mos)",
      "location": "United States (Remote)",
      "tasks": [
        "Led the design, development, and maintenance of websites and e-commerce stores, catering to diverse client needs across various sectors.",
        "Actively involved in the entire development cycle, from concept to deployment, ensuring adherence to best practices and client specifications.",
        "Provided comprehensive technical support, resolving issues to enhance website functionality and user experience."
      ],
      "skills": ["PHP", "WordPress", "SquareSpace", "Wix", "MySQL", "CSS", "Figma", "Technical Support"]
    },
    {
      "title": "WordPress Developer",
      "company": "citiesapps",
      "companyLink": "https://about.citiesapps.com/",
      "type": "Full-time",
      "period": "Nov 2020 - Apr 2021 (6 mos)",
      "location": "Graz, Austria (Remote)",
      "tasks": [
        "Specialized in creating and managing websites for primary schools, focusing on user-friendly and educational interfaces.",
        "Developed a bespoke WordPress plugin for seamless integration with internal applications.- Specialized in creating and managing websites for primary schools, focusing on user-friendly and educational interfaces. - Developed a bespoke WordPress plugin for seamless integration with internal applications."
      ],
      "skills": ["PHP", "WordPress", "MySQL", "JavaScript", "CSS", "Sass", "Frontity/React", "Adobe XD"]
    },
    {
      "title": "Web Developer & Designer",
      "company": "Adverta",
      "companyLink": "https://adverta.si/",
      "type": "Contract",
      "period": "Aug 2019 - Oct 2020 (1 yr 3 mos)",
      "location": "Maribor, Slovenia (Hybrid)",
      "tasks": [
        "Designed and developed compelling web advertisements for various campaigns, optimizing for engagement and conversion.",
        "Contributed to the enhancement of an internal CMS, implementing new features to streamline content management."
      ],
      "skills": ["HTML", "CSS", "JavaScript", "jQuery", "PHP", "Adobe Photoshop"]
    }
  ]
}
